/* automatically generated by rust-bindgen 0.63.0 */

pub mod uhd_error {
    #[doc = "! UHD error codes\n*!\n* Each error code corresponds to a specific uhd::exception, with\n* extra codes corresponding to a boost::exception, std::exception,\n* and a catch-all for everything else. When an internal C++ function\n* throws an exception, UHD converts it to one of these error codes\n* to return on the C level.\n*/"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "! No error thrown."]
    pub const UHD_ERROR_NONE: Type = 0;
    #[doc = "! Invalid device arguments."]
    pub const UHD_ERROR_INVALID_DEVICE: Type = 1;
    #[doc = "! See uhd::index_error."]
    pub const UHD_ERROR_INDEX: Type = 10;
    #[doc = "! See uhd::key_error."]
    pub const UHD_ERROR_KEY: Type = 11;
    #[doc = "! See uhd::not_implemented_error."]
    pub const UHD_ERROR_NOT_IMPLEMENTED: Type = 20;
    #[doc = "! See uhd::usb_error."]
    pub const UHD_ERROR_USB: Type = 21;
    #[doc = "! See uhd::io_error."]
    pub const UHD_ERROR_IO: Type = 30;
    #[doc = "! See uhd::os_error."]
    pub const UHD_ERROR_OS: Type = 31;
    #[doc = "! See uhd::assertion_error."]
    pub const UHD_ERROR_ASSERTION: Type = 40;
    #[doc = "! See uhd::lookup_error."]
    pub const UHD_ERROR_LOOKUP: Type = 41;
    #[doc = "! See uhd::type_error."]
    pub const UHD_ERROR_TYPE: Type = 42;
    #[doc = "! See uhd::value_error."]
    pub const UHD_ERROR_VALUE: Type = 43;
    #[doc = "! See uhd::runtime_error."]

    pub const UHD_ASYNC_METADATA_EVENT_CODE_SEQ_ERROR: Type = 4;
    #[doc = "! Packet had time that was late."]
    pub const UHD_ASYNC_METADATA_EVENT_CODE_TIME_ERROR: Type = 8;
    #[doc = "! Underflow occurred inside a packet."]
    pub const UHD_ASYNC_METADATA_EVENT_CODE_UNDERFLOW_IN_PACKET: Type = 16;
    #[doc = "! Packet loss within a burst."]
    pub const UHD_ASYNC_METADATA_EVENT_CODE_SEQ_ERROR_IN_BURST: Type = 32;
    #[doc = "! Some kind of custom user payload."]
    pub const UHD_ASYNC_METADATA_EVENT_CODE_USER_PAYLOAD: Type = 64;
}
extern "C" {
    #[doc = "! Create a new async metadata handle"]
    pub fn uhd_async_metadata_make(handle: *mut uhd_async_metadata_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Free an async metadata handle\n*!\n* Using a handle after freeing it will result in a segmentation fault.\n*/"]
    pub fn uhd_async_metadata_free(handle: *mut uhd_async_metadata_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Channel number in a MIMO configuration"]
    pub fn uhd_async_metadata_channel(
        h: uhd_async_metadata_handle,
        channel_out: *mut usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Has time specification?"]
    pub fn uhd_async_metadata_has_time_spec(
        h: uhd_async_metadata_handle,
        result_out: *mut bool,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get time specification"]
    pub fn uhd_async_metadata_time_spec(
        h: uhd_async_metadata_handle,
        full_secs_out: *mut i64,
        frac_secs_out: *mut f64,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get last event code"]
    pub fn uhd_async_metadata_event_code(
        h: uhd_async_metadata_handle,
        event_code_out: *mut uhd_async_metadata_event_code_t::Type,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get payload from custom FPGA fabric"]
    pub fn uhd_async_metadata_user_payload(
        h: uhd_async_metadata_handle,
        user_payload_out: *mut u32,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the last error logged by the async metadata object.\n*!\n* NOTE: This function will overwrite any string in the given buffer before\n* inserting the error string.\n*\n* \\param h metadata handle\n* \\param error_out string buffer for error\n* \\param strbuffer_len buffer length\n*/"]
    pub fn uhd_async_metadata_last_error(
        h: uhd_async_metadata_handle,
        error_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
#[doc = "! Range of floating-point values"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_range_t {
    #[doc = "! First value"]
    pub start: f64,
    #[doc = "! Last value"]
    pub stop: f64,
    #[doc = "! Granularity"]
    pub step: f64,
}
#[test]
fn bindgen_test_layout_uhd_range_t() {
    const UNINIT: ::std::mem::MaybeUninit<uhd_range_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uhd_range_t>(),
        24usize,
        concat!("Size of: ", stringify!(uhd_range_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uhd_range_t>(),
        8usize,
        concat!("Alignment of ", stringify!(uhd_range_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_range_t),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stop) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_range_t),
            "::",
            stringify!(stop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_range_t),
            "::",
            stringify!(step)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_meta_range_t {
    _unused: [u8; 0],
}
#[doc = "! C-level interface for dealing with a list of ranges\n*!\n* See uhd::meta_range_t for more details.\n*/"]
pub type uhd_meta_range_handle = *mut uhd_meta_range_t;
extern "C" {
    #[doc = "! Get a string representation of the given range"]
    pub fn uhd_range_to_pp_string(
        range: *const uhd_range_t,
        pp_string_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Create a meta range handle\n*!\n* NOTE: Using a uhd_meta_range_handle before passing it into this function will\n* result in undefined behavior.\n*/"]
    pub fn uhd_meta_range_make(h: *mut uhd_meta_range_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Destroy a meta range handle\n*!\n* NOTE: Using a uhd_meta_range_handle after passing it into this function will\n* result in a segmentation fault.\n*/"]
    pub fn uhd_meta_range_free(h: *mut uhd_meta_range_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the overall start value for the given meta range"]
    pub fn uhd_meta_range_start(h: uhd_meta_range_handle, start_out: *mut f64) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the overall stop value for the given meta range"]
    pub fn uhd_meta_range_stop(h: uhd_meta_range_handle, stop_out: *mut f64) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the overall step value for the given meta range"]
    pub fn uhd_meta_range_step(h: uhd_meta_range_handle, step_out: *mut f64) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Clip the given value to a possible value in the given range"]
    pub fn uhd_meta_range_clip(
        h: uhd_meta_range_handle,
        value: f64,
        clip_step: bool,
        result_out: *mut f64,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the number of ranges in the given meta range"]
    pub fn uhd_meta_range_size(h: uhd_meta_range_handle, size_out: *mut usize) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Add a range to the given meta range"]
    pub fn uhd_meta_range_push_back(
        h: uhd_meta_range_handle,
        range: *const uhd_range_t,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the range at the given index"]
    pub fn uhd_meta_range_at(
        h: uhd_meta_range_handle,
        num: usize,
        range_out: *mut uhd_range_t,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get a string representation of the given meta range"]
    pub fn uhd_meta_range_to_pp_string(
        h: uhd_meta_range_handle,
        pp_string_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the last error recorded by the underlying meta range"]
    pub fn uhd_meta_range_last_error(
        h: uhd_meta_range_handle,
        error_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_sensor_value_t {
    _unused: [u8; 0],
}
#[doc = "! C-level interface for a UHD sensor\n*!\n* See uhd::sensor_value_t for more details.\n*\n* NOTE: Using a handle before calling a make function will result in undefined behavior.\n*/"]
pub type uhd_sensor_value_handle = *mut uhd_sensor_value_t;
pub mod uhd_sensor_value_data_type_t {
    #[doc = "! Sensor value types"]
    pub type Type = ::std::os::raw::c_uint;
    pub const UHD_SENSOR_VALUE_BOOLEAN: Type = 98;
    pub const UHD_SENSOR_VALUE_INTEGER: Type = 105;
    pub const UHD_SENSOR_VALUE_REALNUM: Type = 114;
    pub const UHD_SENSOR_VALUE_STRING: Type = 115;
}
extern "C" {
    #[doc = "! Make an empty UHD sensor value.\n*!\n* The purpose of this call is to populate the handle with a valid sensor value\n* object. Querying this object will always yield 'false'. Typically, this\n* sensor value object will never be used, but it will allow the handle object\n* to be used with sensor functions later on.\n*\n* \\param h the sensor handle in which to place sensor\n* \\returns UHD error code\n*/"]
    pub fn uhd_sensor_value_make(h: *mut uhd_sensor_value_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Make a UHD sensor from a boolean.\n*!\n* \\param h the sensor handle in which to place sensor\n* \\param name sensor name\n* \\param value sensor value\n* \\param utrue string representing \"true\"\n* \\param ufalse string representing \"false\"\n* \\returns UHD error code\n*/"]
    pub fn uhd_sensor_value_make_from_bool(
        h: *mut uhd_sensor_value_handle,
        name: *const ::std::os::raw::c_char,
        value: bool,
        utrue: *const ::std::os::raw::c_char,
        ufalse: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Make a UHD sensor from an integer.\n*!\n* \\param h the sensor value in which to place sensor\n* \\param name sensor name\n* \\param value sensor value\n* \\param unit sensor unit\n* \\param formatter printf-style format string for value string\n* \\returns UHD error code\n*/"]
    pub fn uhd_sensor_value_make_from_int(
        h: *mut uhd_sensor_value_handle,
        name: *const ::std::os::raw::c_char,
        value: ::std::os::raw::c_int,
        unit: *const ::std::os::raw::c_char,
        formatter: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Make a UHD sensor from a real number.\n*!\n* \\param h the sensor value in which to place sensor\n* \\param name sensor name\n* \\param value sensor value\n* \\param unit sensor unit\n* \\param formatter printf-style format string for value string\n* \\returns UHD error code\n*/"]
    pub fn uhd_sensor_value_make_from_realnum(
        h: *mut uhd_sensor_value_handle,
        name: *const ::std::os::raw::c_char,
        value: f64,
        unit: *const ::std::os::raw::c_char,
        formatter: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Make a UHD sensor from a string.\n*!\n* \\param h the sensor value in which to place sensor\n* \\param name sensor name\n* \\param value sensor value\n* \\param unit sensor unit\n* \\returns UHD error code\n*/"]
    pub fn uhd_sensor_value_make_from_string(
        h: *mut uhd_sensor_value_handle,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        unit: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Free the given sensor handle.\n*!\n* Attempting to use the handle after calling this handle will\n* result in a segmentation fault.\n*/"]
    pub fn uhd_sensor_value_free(h: *mut uhd_sensor_value_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the sensor's value as a boolean."]
    pub fn uhd_sensor_value_to_bool(
        h: uhd_sensor_value_handle,
        value_out: *mut bool,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the sensor's value as an integer."]
    pub fn uhd_sensor_value_to_int(
        h: uhd_sensor_value_handle,
        value_out: *mut ::std::os::raw::c_int,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the sensor's value as a real number."]
    pub fn uhd_sensor_value_to_realnum(
        h: uhd_sensor_value_handle,
        value_out: *mut f64,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the sensor's name.\n*!\n* NOTE: This function will overwrite any string in the given\n* buffer before inserting the sensor name.\n*\n* \\param h sensor handle\n* \\param name_out string buffer in which to place name\n* \\param strbuffer_len buffer length\n*/"]
    pub fn uhd_sensor_value_name(
        h: uhd_sensor_value_handle,
        name_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the sensor's value.\n*!\n* NOTE: This function will overwrite any string in the given\n* buffer before inserting the sensor value.\n*\n* \\param h sensor handle\n* \\param value_out string buffer in which to place value\n* \\param strbuffer_len buffer length\n*/"]
    pub fn uhd_sensor_value_value(
        h: uhd_sensor_value_handle,
        value_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the sensor's unit.\n*!\n* NOTE: This function will overwrite any string in the given\n* buffer before inserting the sensor unit.\n*\n* \\param h sensor handle\n* \\param unit_out string buffer in which to place unit\n* \\param strbuffer_len buffer length\n*/"]
    pub fn uhd_sensor_value_unit(
        h: uhd_sensor_value_handle,
        unit_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    pub fn uhd_sensor_value_data_type(
        h: uhd_sensor_value_handle,
        data_type_out: *mut uhd_sensor_value_data_type_t::Type,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get a pretty-print representation of the given sensor.\n*!\n* NOTE: This function will overwrite any string in the given\n* buffer before inserting the string.\n*\n* \\param h sensor handle\n* \\param pp_string_out string buffer in which to place pp_string\n* \\param strbuffer_len buffer length\n*/"]
    pub fn uhd_sensor_value_to_pp_string(
        h: uhd_sensor_value_handle,
        pp_string_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the last error logged by the sensor handle.\n*!\n* NOTE: This function will overwrite any string in the given\n* buffer before inserting the error string.\n*\n* \\param h sensor handle\n* \\param error_out string buffer in which to place error\n* \\param strbuffer_len buffer length\n*/"]
    pub fn uhd_sensor_value_last_error(
        h: uhd_sensor_value_handle,
        error_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
#[doc = "! C-level read-only interface for interacting with a string vector"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_string_vector_t {
    _unused: [u8; 0],
}
pub type uhd_string_vector_handle = *mut uhd_string_vector_t;
extern "C" {
    #[doc = "! Instantiate a string_vector handle."]
    pub fn uhd_string_vector_make(h: *mut uhd_string_vector_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Safely destroy a string_vector handle."]
    pub fn uhd_string_vector_free(h: *mut uhd_string_vector_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Add a string to the list"]
    pub fn uhd_string_vector_push_back(
        h: *mut uhd_string_vector_handle,
        value: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the string at the given index"]
    pub fn uhd_string_vector_at(
        h: uhd_string_vector_handle,
        index: usize,
        value_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the number of strings in this list"]
    pub fn uhd_string_vector_size(
        h: uhd_string_vector_handle,
        size_out: *mut usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the last error reported by the underlying object"]
    pub fn uhd_string_vector_last_error(
        h: uhd_string_vector_handle,
        error_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
pub mod uhd_tune_request_policy_t {
    #[doc = "! Policy options for tunable elements in the RF chain."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "! Do not set this argument, use current setting."]
    pub const UHD_TUNE_REQUEST_POLICY_NONE: Type = 78;
    #[doc = "! Automatically determine the argument's value."]
    pub const UHD_TUNE_REQUEST_POLICY_AUTO: Type = 65;
    #[doc = "! Use the argument's value for the setting."]
    pub const UHD_TUNE_REQUEST_POLICY_MANUAL: Type = 77;
}
#[doc = "! Instructs implementation how to tune the RF chain\n*!\n* See uhd::tune_request_t for more details.\n*/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_tune_request_t {
    #[doc = "! Target frequency for RF chain in Hz"]
    pub target_freq: f64,
    #[doc = "! RF frequency policy"]
    pub rf_freq_policy: uhd_tune_request_policy_t::Type,
    #[doc = "! RF frequency in Hz"]
    pub rf_freq: f64,
    #[doc = "! DSP frequency policy"]
    pub dsp_freq_policy: uhd_tune_request_policy_t::Type,
    #[doc = "! DSP frequency in Hz"]
    pub dsp_freq: f64,
    #[doc = "! Key-value pairs delimited by commas"]
    pub args: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_uhd_tune_request_t() {
    const UNINIT: ::std::mem::MaybeUninit<uhd_tune_request_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uhd_tune_request_t>(),
        48usize,
        concat!("Size of: ", stringify!(uhd_tune_request_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uhd_tune_request_t>(),
        8usize,
        concat!("Alignment of ", stringify!(uhd_tune_request_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_freq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_request_t),
            "::",
            stringify!(target_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rf_freq_policy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_request_t),
            "::",
            stringify!(rf_freq_policy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rf_freq) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_request_t),
            "::",
            stringify!(rf_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dsp_freq_policy) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_request_t),
            "::",
            stringify!(dsp_freq_policy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dsp_freq) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_request_t),
            "::",
            stringify!(dsp_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).args) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_request_t),
            "::",
            stringify!(args)
        )
    );
}
#[doc = "! Stores RF and DSP tuned frequencies.\n*!\n* See uhd::tune_result_t for more details.\n*/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_tune_result_t {
    #[doc = "! Target RF frequency, clipped to be within system range"]
    pub clipped_rf_freq: f64,
    #[doc = "! Target RF frequency, including RF FE offset"]
    pub target_rf_freq: f64,
    #[doc = "! Frequency to which RF LO is actually tuned"]
    pub actual_rf_freq: f64,
    #[doc = "! Frequency the CORDIC must adjust the RF"]
    pub target_dsp_freq: f64,
    #[doc = "! Frequency to which the CORDIC in the DSP actually tuned"]
    pub actual_dsp_freq: f64,
}
#[test]
fn bindgen_test_layout_uhd_tune_result_t() {
    const UNINIT: ::std::mem::MaybeUninit<uhd_tune_result_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uhd_tune_result_t>(),
        40usize,
        concat!("Size of: ", stringify!(uhd_tune_result_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uhd_tune_result_t>(),
        8usize,
        concat!("Alignment of ", stringify!(uhd_tune_result_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clipped_rf_freq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_result_t),
            "::",
            stringify!(clipped_rf_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_rf_freq) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_result_t),
            "::",
            stringify!(target_rf_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actual_rf_freq) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_result_t),
            "::",
            stringify!(actual_rf_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_dsp_freq) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_result_t),
            "::",
            stringify!(target_dsp_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actual_dsp_freq) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_tune_result_t),
            "::",
            stringify!(actual_dsp_freq)
        )
    );
}
extern "C" {
    #[doc = "! Create a pretty print representation of this tune result."]
    pub fn uhd_tune_result_to_pp_string(
        tune_result: *mut uhd_tune_result_t,
        pp_string_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    );
}
#[doc = "! USRP RX info\n*!\n* This struct is populated by uhd_usrp_get_rx_info().\n*/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_usrp_rx_info_t {
    #[doc = "! Motherboard ID"]
    pub mboard_id: *mut ::std::os::raw::c_char,
    #[doc = "! Motherboard name"]
    pub mboard_name: *mut ::std::os::raw::c_char,
    #[doc = "! Motherboard serial"]
    pub mboard_serial: *mut ::std::os::raw::c_char,
    #[doc = "! RX daughterboard ID"]
    pub rx_id: *mut ::std::os::raw::c_char,
    #[doc = "! RX subdev name"]
    pub rx_subdev_name: *mut ::std::os::raw::c_char,
    #[doc = "! RX subdev spec"]
    pub rx_subdev_spec: *mut ::std::os::raw::c_char,
    #[doc = "! RX daughterboard serial"]
    pub rx_serial: *mut ::std::os::raw::c_char,
    #[doc = "! RX daughterboard antenna"]
    pub rx_antenna: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_uhd_usrp_rx_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<uhd_usrp_rx_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uhd_usrp_rx_info_t>(),
        64usize,
        concat!("Size of: ", stringify!(uhd_usrp_rx_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uhd_usrp_rx_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(uhd_usrp_rx_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mboard_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_rx_info_t),
            "::",
            stringify!(mboard_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mboard_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_rx_info_t),
            "::",
            stringify!(mboard_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mboard_serial) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_rx_info_t),
            "::",
            stringify!(mboard_serial)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_rx_info_t),
            "::",
            stringify!(rx_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_subdev_name) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_rx_info_t),
            "::",
            stringify!(rx_subdev_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_subdev_spec) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_rx_info_t),
            "::",
            stringify!(rx_subdev_spec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_serial) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_rx_info_t),
            "::",
            stringify!(rx_serial)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_antenna) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_rx_info_t),
            "::",
            stringify!(rx_antenna)
        )
    );
}
#[doc = "! USRP TX info\n*!\n* This struct is populated by uhd_usrp_get_tx_info().\n*/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_usrp_tx_info_t {
    #[doc = "! Motherboard ID"]
    pub mboard_id: *mut ::std::os::raw::c_char,
    #[doc = "! Motherboard name"]
    pub mboard_name: *mut ::std::os::raw::c_char,
    #[doc = "! Motherboard serial"]
    pub mboard_serial: *mut ::std::os::raw::c_char,
    #[doc = "! TX daughterboard ID"]
    pub tx_id: *mut ::std::os::raw::c_char,
    #[doc = "! TX subdev name"]
    pub tx_subdev_name: *mut ::std::os::raw::c_char,
    #[doc = "! TX subdev spec"]
    pub tx_subdev_spec: *mut ::std::os::raw::c_char,
    #[doc = "! TX daughterboard serial"]
    pub tx_serial: *mut ::std::os::raw::c_char,
    #[doc = "! TX daughterboard antenna"]
    pub tx_antenna: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_uhd_usrp_tx_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<uhd_usrp_tx_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uhd_usrp_tx_info_t>(),
        64usize,
        concat!("Size of: ", stringify!(uhd_usrp_tx_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uhd_usrp_tx_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(uhd_usrp_tx_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mboard_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_tx_info_t),
            "::",
            stringify!(mboard_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mboard_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_tx_info_t),
            "::",
            stringify!(mboard_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mboard_serial) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_tx_info_t),
            "::",
            stringify!(mboard_serial)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_tx_info_t),
            "::",
            stringify!(tx_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_subdev_name) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_tx_info_t),
            "::",
            stringify!(tx_subdev_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_subdev_spec) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_tx_info_t),
            "::",
            stringify!(tx_subdev_spec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_serial) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_tx_info_t),
            "::",
            stringify!(tx_serial)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_antenna) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_usrp_tx_info_t),
            "::",
            stringify!(tx_antenna)
        )
    );
}
extern "C" {
    #[doc = "! Clean up a uhd_usrp_rx_info_t populated by uhd_usrp_get_rx_info().\n*!\n* NOTE: If this function is passed a uhd_usrp_rx_info_t that has not\n* been populated by uhd_usrp_get_rx_info(), it will produce a double-free\n* error.\n*/"]
    pub fn uhd_usrp_rx_info_free(rx_info: *mut uhd_usrp_rx_info_t) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Clean up a uhd_usrp_tx_info_t populated by uhd_usrp_get_tx_info().\n*!\n* NOTE: If this function is passed a uhd_usrp_tx_info_t that has not\n* been populated by uhd_usrp_get_tx_info(), it will produce a double-free\n* error.\n*/"]
    pub fn uhd_usrp_tx_info_free(tx_info: *mut uhd_usrp_tx_info_t) -> uhd_error::Type;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_dboard_eeprom_t {
    _unused: [u8; 0],
}
#[doc = "! A C-level interface for interacting with a daughterboard EEPROM\n*!\n* See uhd::usrp::dboard_eeprom_t for more details.\n*\n* NOTE: Using a handle before passing it into uhd_dboard_eeprom_make() will\n* result in undefined behavior.\n*/"]
pub type uhd_dboard_eeprom_handle = *mut uhd_dboard_eeprom_t;
extern "C" {
    #[doc = "! Create handle for a USRP daughterboard EEPROM"]
    pub fn uhd_dboard_eeprom_make(h: *mut uhd_dboard_eeprom_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Safely destroy the given handle\n*!\n* NOTE: Using a handle after passing it into this function will result in\n* a segmentation fault.\n*/"]
    pub fn uhd_dboard_eeprom_free(h: *mut uhd_dboard_eeprom_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the ID associated with the given daughterboard as a string hex representation"]
    pub fn uhd_dboard_eeprom_get_id(
        h: uhd_dboard_eeprom_handle,
        id_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Set the daughterboard ID using a string hex representation"]
    pub fn uhd_dboard_eeprom_set_id(
        h: uhd_dboard_eeprom_handle,
        id: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the daughterboard's serial"]
    pub fn uhd_dboard_eeprom_get_serial(
        h: uhd_dboard_eeprom_handle,
        serial_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Set the daughterboard's serial"]
    pub fn uhd_dboard_eeprom_set_serial(
        h: uhd_dboard_eeprom_handle,
        serial: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = " Get the daughterboard's revision\n\n The revision doesn't always have to be present, in which case this function\n will return an error."]
    pub fn uhd_dboard_eeprom_get_revision(
        h: uhd_dboard_eeprom_handle,
        revision_out: *mut ::std::os::raw::c_int,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Set the daughterboard's revision"]
    pub fn uhd_dboard_eeprom_set_revision(
        h: uhd_dboard_eeprom_handle,
        revision: ::std::os::raw::c_int,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the last error reported by the handle"]
    pub fn uhd_dboard_eeprom_last_error(
        h: uhd_dboard_eeprom_handle,
        error_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_mboard_eeprom_t {
    _unused: [u8; 0],
}
#[doc = "! A C-level interface for interacting with a USRP motherboard's EEPROM\n*!\n* See uhd::usrp::mboard_eeprom_t for more details.\n*\n* NOTE: Using a handle before passing it into uhd_mboard_eeprom_make() will\n* result in undefined behavior.\n*/"]
pub type uhd_mboard_eeprom_handle = *mut uhd_mboard_eeprom_t;
extern "C" {
    #[doc = "! Create a handle for working with a USRP motherboard EEPROM"]
    pub fn uhd_mboard_eeprom_make(h: *mut uhd_mboard_eeprom_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Free a USRP motherboard EEPROM handle\n*!\n* NOTE: Using a handle after passing it into this function will result in\n* a segmentation fault.\n*/"]
    pub fn uhd_mboard_eeprom_free(h: *mut uhd_mboard_eeprom_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the value associated with the given EEPROM key"]
    pub fn uhd_mboard_eeprom_get_value(
        h: uhd_mboard_eeprom_handle,
        key: *const ::std::os::raw::c_char,
        value_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Set the value for the given EEPROM key"]
    pub fn uhd_mboard_eeprom_set_value(
        h: uhd_mboard_eeprom_handle,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the last error recorded by the handle"]
    pub fn uhd_mboard_eeprom_last_error(
        h: uhd_mboard_eeprom_handle,
        error_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
#[doc = "! Subdevice specification"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_subdev_spec_pair_t {
    pub db_name: *mut ::std::os::raw::c_char,
    #[doc = "! Subdevice name"]
    pub sd_name: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_uhd_subdev_spec_pair_t() {
    const UNINIT: ::std::mem::MaybeUninit<uhd_subdev_spec_pair_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uhd_subdev_spec_pair_t>(),
        16usize,
        concat!("Size of: ", stringify!(uhd_subdev_spec_pair_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uhd_subdev_spec_pair_t>(),
        8usize,
        concat!("Alignment of ", stringify!(uhd_subdev_spec_pair_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).db_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_subdev_spec_pair_t),
            "::",
            stringify!(db_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sd_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_subdev_spec_pair_t),
            "::",
            stringify!(sd_name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_subdev_spec_t {
    _unused: [u8; 0],
}
#[doc = "! A C-level interface for working with a list of subdevice specifications\n*!\n* See uhd::usrp::subdev_spec_t for more details.\n*\n* NOTE: Using a handle before passing it into uhd_subdev_spec_make() will result in\n* undefined behavior.\n*/"]
pub type uhd_subdev_spec_handle = *mut uhd_subdev_spec_t;
extern "C" {
    #[doc = "! Safely destroy any memory created in the generation of a uhd_subdev_spec_pair_t"]
    pub fn uhd_subdev_spec_pair_free(
        subdev_spec_pair: *mut uhd_subdev_spec_pair_t,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Check to see if two subdevice specifications are equal"]
    pub fn uhd_subdev_spec_pairs_equal(
        first: *const uhd_subdev_spec_pair_t,
        second: *const uhd_subdev_spec_pair_t,
        result_out: *mut bool,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Create a handle for a list of subdevice specifications"]
    pub fn uhd_subdev_spec_make(
        h: *mut uhd_subdev_spec_handle,
        markup: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Safely destroy a subdevice specification handle\n*!\n* NOTE: Using a handle after passing it into this function will result in\n* a segmentation fault.\n*/"]
    pub fn uhd_subdev_spec_free(h: *mut uhd_subdev_spec_handle) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Check how many subdevice specifications are in this list"]
    pub fn uhd_subdev_spec_size(h: uhd_subdev_spec_handle, size_out: *mut usize)
        -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Add a subdevice specification to this list"]
    pub fn uhd_subdev_spec_push_back(
        h: uhd_subdev_spec_handle,
        markup: *const ::std::os::raw::c_char,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the subdevice specification at the given index"]
    pub fn uhd_subdev_spec_at(
        h: uhd_subdev_spec_handle,
        num: usize,
        subdev_spec_pair_out: *mut uhd_subdev_spec_pair_t,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get a string representation of the given list"]
    pub fn uhd_subdev_spec_to_pp_string(
        h: uhd_subdev_spec_handle,
        pp_string_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get a markup string representation of the given list"]
    pub fn uhd_subdev_spec_to_string(
        h: uhd_subdev_spec_handle,
        string_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
extern "C" {
    #[doc = "! Get the last error recorded by the given handle"]
    pub fn uhd_subdev_spec_last_error(
        h: uhd_subdev_spec_handle,
        error_out: *mut ::std::os::raw::c_char,
        strbuffer_len: usize,
    ) -> uhd_error::Type;
}
#[doc = "! A struct of parameters to construct a stream.\n*!\n* See uhd::stream_args_t for more details.\n*/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_stream_args_t {
    #[doc = "! Format of host memory"]
    pub cpu_format: *mut ::std::os::raw::c_char,
    #[doc = "! Over-the-wire format"]
    pub otw_format: *mut ::std::os::raw::c_char,
    #[doc = "! Other stream args"]
    pub args: *mut ::std::os::raw::c_char,
    #[doc = "! Array that lists channels"]
    pub channel_list: *mut usize,
    #[doc = "! Number of channels"]
    pub n_channels: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_uhd_stream_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<uhd_stream_args_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uhd_stream_args_t>(),
        40usize,
        concat!("Size of: ", stringify!(uhd_stream_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uhd_stream_args_t>(),
        8usize,
        concat!("Alignment of ", stringify!(uhd_stream_args_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpu_format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_args_t),
            "::",
            stringify!(cpu_format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).otw_format) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_args_t),
            "::",
            stringify!(otw_format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).args) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_args_t),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_args_t),
            "::",
            stringify!(channel_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_channels) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_args_t),
            "::",
            stringify!(n_channels)
        )
    );
}
pub mod uhd_stream_mode_t {
    #[doc = "! How streaming is issued to the device\n*!\n* See uhd::stream_cmd_t for more details.\n*/"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "! Stream samples indefinitely"]
    pub const UHD_STREAM_MODE_START_CONTINUOUS: Type = 97;
    #[doc = "! End continuous streaming"]
    pub const UHD_STREAM_MODE_STOP_CONTINUOUS: Type = 111;
    #[doc = "! Stream some number of samples and finish"]
    pub const UHD_STREAM_MODE_NUM_SAMPS_AND_DONE: Type = 100;
    #[doc = "! Stream some number of samples but expect more"]
    pub const UHD_STREAM_MODE_NUM_SAMPS_AND_MORE: Type = 109;
}
#[doc = "! Define how device streams to host\n*!\n* See uhd::stream_cmd_t for more details.\n*/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_stream_cmd_t {
    #[doc = "! How streaming is issued to the device"]
    pub stream_mode: uhd_stream_mode_t::Type,
    #[doc = "! Number of samples"]
    pub num_samps: usize,
    #[doc = "! Stream now?"]
    pub stream_now: bool,
    #[doc = "! If not now, then full seconds into future to stream"]
    pub time_spec_full_secs: i64,
    #[doc = "! If not now, then fractional seconds into future to stream"]
    pub time_spec_frac_secs: f64,
}
#[test]
fn bindgen_test_layout_uhd_stream_cmd_t() {
    const UNINIT: ::std::mem::MaybeUninit<uhd_stream_cmd_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uhd_stream_cmd_t>(),
        40usize,
        concat!("Size of: ", stringify!(uhd_stream_cmd_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uhd_stream_cmd_t>(),
        8usize,
        concat!("Alignment of ", stringify!(uhd_stream_cmd_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stream_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_cmd_t),
            "::",
            stringify!(stream_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_samps) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_cmd_t),
            "::",
            stringify!(num_samps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stream_now) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_cmd_t),
            "::",
            stringify!(stream_now)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_spec_full_secs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_cmd_t),
            "::",
            stringify!(time_spec_full_secs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_spec_frac_secs) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uhd_stream_cmd_t),
            "::",
            stringify!(time_spec_frac_secs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_rx_streamer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uhd_tx_streamer {
    _unused: [u8; 0],
}
#[doc = "! C-level interface for working with an RX streamer\n*!\n* See uhd::rx_streamer for more details.\n*/"]
pub type uhd_rx_streamer_handle = *mut uhd_rx_streamer;
#[doc = "! C-level interface for working with a TX streamer\n*!\n* See uhd::tx_streamer for more details.\n*/"]
pub type uhd_tx_streamer_handle = *mut uhd_tx_streamer;
extern "C" {
    #[doc = "! Create an RX streamer handle.\n*!\n* NOTE: Using this streamer before passing it into uhd_usrp_get_rx_stream()\n* will result in undefined behavior.\n*/"]
    pub fn uhd_rx_streamer_make(h: *mut uhd_rx_streamer_handle) -> uhd_error::Type;
}
extern "C" {
